       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-CGI.
       PROCEDURE DIVISION.
           DISPLAY "Content-type: text/html".
           DISPLAY " ".
           DISPLAY "<html><body>".
           DISPLAY "<h1>Salut din GnuCOBOL!</h1>".
           DISPLAY "<p>Ledger of Ages este gata de constructie.</p>".
           DISPLAY "</body></html>".
           STOP RUN.
