IDENTIFICATION DIVISION.
PROGRAM-ID. SEED-LEDGER.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT TRANSACTIONS-FILE ASSIGN TO "data/ledger.dat"
        ORGANIZATION IS INDEXED
        ACCESS MODE IS DYNAMIC
        RECORD KEY IS TRANS-ID
        FILE STATUS IS FS-LEDGER.

DATA DIVISION.
FILE SECTION.
FD  TRANSACTIONS-FILE.
01  TRANS-RECORD.
    05  TRANS-ID            PIC X(10).
    05  TRANS-DATE          PIC X(10).
    05  TRANS-DESC          PIC X(30).
    05  TRANS-AMOUNT        PIC S9(7)V99.

WORKING-STORAGE SECTION.
01  FS-LEDGER               PIC XX.

PROCEDURE DIVISION.
    DISPLAY "Seding ledger...".
    OPEN OUTPUT TRANSACTIONS-FILE.
    DISPLAY "Status Open Output: " FS-LEDGER.

    MOVE "0000000001" TO TRANS-ID.
    MOVE "2026-04-18" TO TRANS-DATE.
    MOVE "Salariu Aprilie" TO TRANS-DESC.
    MOVE 5000.00 TO TRANS-AMOUNT.
    WRITE TRANS-RECORD.
    DISPLAY "Status Write 1: " FS-LEDGER.

    MOVE "0000000002" TO TRANS-ID.
    MOVE "2026-04-18" TO TRANS-DATE.
    MOVE "Chirie" TO TRANS-DESC.
    MOVE -1200.00 TO TRANS-AMOUNT.
    WRITE TRANS-RECORD.
    DISPLAY "Status Write 2: " FS-LEDGER.

    CLOSE TRANSACTIONS-FILE.
    STOP RUN.
